//
//  DZ 31-32 - Obj_UITableView_Edit_Custom.h
//  DZ 31-32 - Obj_UITableView_Editinf_Cucto
//
//  Created by mac on 14.01.18.
//  Copyright © 2018 Dima Zgera. All rights reserved.
//

#ifndef DZ_31_32___Obj_UITableView_Edit_Custom_h
#define DZ_31_32___Obj_UITableView_Edit_Custom_h


#endif /* DZ_31_32___Obj_UITableView_Edit_Custom_h */


Итак редактируем наши таблицы.

Задание.

Ученик

1. Создайте контроллер с таблицей в коде без сторибордов.
2. Заполните таблицу данными на свое усмотрение
3. Объедините данные в группы (секции)

Студент.

4. Реализуйте механизм перемещения данных между рядами и секциями
5. Вы должны четко понимать что и как работает и в какой последовательности поэтому повторяйте задание пока вы полностью не освоите этот механизм

Мастер.

6. Реализуйте удаление рядов

Супермен

7. Реализуйте механзм добавления секций и рядов на ваше усмотрение
